app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("title", "start_time", "date", "duration", "recurring", "trainer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"