app/controllers/studios_controller.rb

INSERT INTO "studios" ("name", "location", "phone", "website_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test Studio"], ["location", "here"], ["phone", ""], ["website_url", ""], ["created_at", "2020-02-13 21:38:32.594093"], ["updated_at", "2020-02-13 21:38:32.594093"]]
---
  def create
    @studio = Studio.new(studio_params)
    attach_image

    if @studio.save

SELECT "studios".* FROM "studios"
---
  def index
    @studios = Studio.all

UPDATE "studios" SET "location" = $1, "updated_at" = $2 WHERE "studios"."id" = $3  [["location", "herez"], ["updated_at", "2020-02-13 21:41:16.796154"], ["id", 1]]
---
  def update
    if !params[:studio][:avatar].nil?
      attach_image
    end

    if @studio.update_attributes(studio_params)

DELETE FROM "studios" WHERE "studios"."id" = $1  [["id", 2]]
---
  def destroy
    @studio.destroy

SELECT  "studios".* FROM "studios" WHERE "studios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def load_studio
    @studio = Studio.find(params[:id])