app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE (first_name ILIKE '%b%' OR last_name ILIKE '%b%' AND cast(role as text) LIKE '1') ORDER BY first_name ASC
SELECT "studios".* FROM "studios" WHERE (name ILIKE '%b%') ORDER BY name ASC
SELECT "users".* FROM "users" WHERE (first_name ILIKE '%ad%' OR last_name ILIKE '%ad%') AND "users"."role" = $1 ORDER BY first_name ASC  [["role", 1]]
---
  def index
    if !params[:search].blank?
      @users = User.search(params[:search]).order("first_name ASC")
      @studios = Studio.search(params[:search]).order("name ASC")
    # elsif !params[:category].blank?
    #   @users = users.where(category: params[:category]).order("category ASC")
    else
      @users = User.where(role: 1).order("first_name ASC")

UPDATE "users" SET "phone" = $1, "location" = $2, "first_name" = $3, "last_name" = $4, "website_url" = $5, "description" = $6, "updated_at" = $7 WHERE "users"."id" = $8  [["phone", ""], ["location", ""], ["first_name", "Test"], ["last_name", "Acc"], ["website_url", ""], ["description", "afafs"], ["updated_at", "2020-02-20 18:23:19.156396"], ["id", 1]]
---
  def update
    if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def load_user
    @user = User.find(params[:id])